[
  {
    "title": "My Portfolio",
    "software": "Figma, React JS & Styled Components",
    "image": "./images/laptop-portfolio.png",
    "url": "https://jovial-wozniak-a83e5a.netlify.app/",
    "background": "./images/portfolio-background.jpg",
    "outline": "A portfolio is a collection of work that a showcases a persons skills. Employers can gain an understanding of the person by viewing their portfolio and decide whether they will be the right fit.",
    "challenge": "To try and showcase of my skills I created a portfolio that displays information about me and the projects I’ve created.",
    "personaDescription": "To better emphasise with the users I created two personas. These reminded me who the users are and what their needs and goals are. John is a lead front end web developer who is looking to recruit a junior developer. Paul is trying to find a junior developer for one of his clients.",
    "personaImage": "./images/persona-portfolio.png",
    "sketchDescription": "Before sketching I went onto Dribble to find some inspiration for the designs and colours for my portfolio. I then did some rough sketches in order to have a unique layout but also keep a good user experience.",
    "sketchImage": "./images/sketch-portfolio.png",
    "wireframeDescription": "After sketching up a few designs I turned them into wireframes to visualize them.  I came up with two call to actions on the home page, which are a link to my portfolio and to my cv. As these are the two main goals of the users.",
    "wireframeImage": "./images/wireframes-portfolio.png",
    "fidelityDescription": "After the wireframes, I added fonts and colours to make the design look more visually appealing. I also added in a LinkedIn icon for another way for employers to contact me. Based on these designs I then coded up my portfolio.",
    "fidelityImage": "./images/high-portfolio.png"
  },
  {
    "title": "Doggie Walks",
    "software": "Figma, React JS & Styled Components",
    "image": "./images/laptop-doggie.png",
    "url": "https://compassionate-meninsky-dbec3b.netlify.app/home",
    "background": "./images/doggie-background.jpg",
    "outline": "Doggie walks are a dog walking service which is based in Ormskirk. They offer exciting and stimulating walks for dogs all over Lancashire and Merseyside countryside.",
    "challenge": "The client wanted a website with a heavy emphasis on content and images throughout. They needed customers to be able to enquire throughout the site and would like them to know how they can do this.",
    "personaDescription": "I created these two personas to help me understand how I can help her/him achieve their goal on the site. Amy needs an easy point of contact to enquire on her dinner break and Alex needs to know what areas they cover when visiting the site.",
    "personaImage": "./images/persona-doggie.png",
    "sketchDescription": "I started sketching out my ideas on a whiteboard to experiment with different designs I had in mind for the site. I sketched call to actions on a whiteboard because it helps me to iterate my designs quickly and create more ideas.",
    "sketchImage": "./images/sketch-doggie.png",
    "wireframeDescription": "After sketching I refined the best ideas and turned them into wireframes using Figma. One of the ideas was to include the contact details on every page by placing them in the navigation and footer.",
    "wireframeImage": "./images/wireframes-doggie.png",
    "fidelityDescription": "I created the wireframes into high fidelity design in Figma to gather feedback from the client. I got positive feedback from the client and they liked the locations banner on the pages. I then coded up the website based on these designs.",
    "fidelityImage": "./images/high-doggie.png"
  },
  {
    "title": "Web Responsive Tester",
    "software": "Javascript, Gulp & SCSS",
    "image": "./images/laptop-teseter.png",
    "url": "https://tender-tereshkova-5882d0.netlify.app/",
    "background": "./images/tester-background.png",
    "outline": "Nuttersons are a digital agency based in Manchester who create websites for small local businesses.",
    "challenge": "The client wanted a page which would allow their web developers to check the responsiveness of their websites.",
    "personaDescription": "To help create a page that would be focused on the user’s needs a persona was done. Dave needs to be able to compare screen sizes against one another and to be able to hide devices on the screen.",
    "personaImage": "./images/persona-tester.png",
    "sketchDescription": "I did sketches to explore different variations on how I could show multiple devices on one screen. To save the developer from scrolling sideways I thought that displaying all the devices in a column would be more suitable for the developer.",
    "sketchImage": "./images/sketch-responsive.png",
    "wireframeDescription": "I then went into Figma to create a wireframe to visualize how this design would look. The design show’s that this idea is scalable and would allow the developer to view and compare different screens at once.",
    "wireframeImage": "./images/wireframes-tester.png",
    "fidelityDescription": "After wireframing I turned the page into a high fidelity design to gather feedback from the client. I also included buttons on the side for the developer to be able to hide devices. The client was impressed with my design and so, therefore, the designs were coded up.",
    "fidelityImage": "./images/high-tester.png"
  }
]
